########## Terminal apps ##########
brew "git"
brew "zsh"
brew "mas"
brew "nvm"
brew "python"
brew "tldr"
brew "heroku/brew/heroku"
brew "fzf"
brew "tmux"
brew "gpg"
###################################

########## Desktop Apps ##########
# Programming
tap "AdoptOpenJDK/openjdk"
cask "adoptopenjdk8"

# Programming tools
cask "intellij-idea"
cask "visual-studio-code"

cask "docker"
cask "mysqlworkbench"
cask "iterm2"

cask "bitbar"
cask "hammerspoon"

# Tools
cask "notion"
cask "google-chrome"
cask "vmware-horizon-client"
cask "slack"
cask "postman"
##################################

########## App Store ##########
mas "KakaoTalk", id: 869223134
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
###############################
